---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotElevBase
source: html/3d6a3a24-feb8-013c-f6d4-09e40c57ca14.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotElevBase Property

"Elevation Base"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotElevBase { get; }
```